turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X4E.atdf
          </instance>
        </module>
        <module name="TC" version="6082R">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40080000"/>
            <signals>
              <signal pad="PB26" function="B" group="TCLK" index="0"/>
              <signal pad="PA4" function="A" group="TCLK" index="1"/>
              <signal pad="PA7" function="A" group="TCLK" index="2"/>
              <signal pad="PB25" function="B" group="TIOA" index="0"/>
              <signal pad="PA2" function="A" group="TIOA" index="1"/>
              <signal pad="PA5" function="A" group="TIOA" index="2"/>
              <signal pad="PB27" function="B" group="TIOB" index="0"/>
              <signal pad="PA3" function="A" group="TIOB" index="1"/>
              <signal pad="PA6" function="A" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40084000"/>
            <signals>
              <signal pad="PA22" function="B" group="TCLK" index="3"/>
              <signal pad="PA23" function="B" group="TCLK" index="4"/>
              <signal pad="PB16" function="A" group="TCLK" index="5"/>
              <signal pad="PB0" function="B" group="TIOA" index="3"/>
              <signal pad="PE9" function="A" group="TIOA" index="3"/>
              <signal pad="PB2" function="B" group="TIOA" index="4"/>
              <signal pad="PE11" function="A" group="TIOA" index="4"/>
              <signal pad="PB4" function="B" group="TIOA" index="5"/>
              <signal pad="PE13" function="A" group="TIOA" index="5"/>
              <signal pad="PB1" function="B" group="TIOB" index="3"/>
              <signal pad="PE10" function="A" group="TIOB" index="3"/>
              <signal pad="PB3" function="B" group="TIOB" index="4"/>
              <signal pad="PE12" function="A" group="TIOB" index="4"/>
              <signal pad="PB5" function="B" group="TIOB" index="5"/>
              <signal pad="PE14" function="A" group="TIOB" index="5"/>
            </signals>
          </instance>
          <instance name="TC2">
            <register-group address-space="base" name="TC2" name-in-module="TC" offset="0x40088000"/>
            <signals>
              <signal pad="PC27" function="B" group="TCLK" index="6"/>
              <signal pad="PC30" function="B" group="TCLK" index="7"/>
              <signal pad="PD9" function="B" group="TCLK" index="8"/>
              <signal pad="PC25" function="B" group="TIOA" index="6"/>
              <signal pad="PC28" function="B" group="TIOA" index="7"/>
              <signal pad="PD7" function="B" group="TIOA" index="8"/>
              <signal pad="PC26" function="B" group="TIOB" index="6"/>
              <signal pad="PC29" function="B" group="TIOB" index="7"/>
              <signal pad="PD8" function="B" group="TIOB" index="8"/>
            </signals>
          </instance>
        </module>
        <module name="TRNG" version="6334D">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0x400BC000"/>
          </instance>
        </module>
        <module name="TWI" version="6212O">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x4008C000"/>
            <signals>
              <signal pad="PA18" function="A" group="TWCK" index="0"/>
              <signal pad="PA17" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x40090000"/>
            <signals>
              <signal pad="PB13" function="A" group="TWCK" index="1"/>
              <signal pad="PB12" function="A" group="TWD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UART" version="6418H">
          <instance name="UART">
            <register-group address-space="base" name="UART" name-in-module="UART" offset="0x400E0800"/>
            <signals>
              <signal pad="PA8" function="A" group="URXD"/>
              <signal pad="PA9" function="A" group="UTXD"/>
            </signals>
          </instance>
        </module>
        <module name="UOTGHS" version="11016C">
          <instance name="UOTGHS">
            <register-group address-space="base" name="UOTGHS" name-in-module="UOTGHS" offset="0x400AC000"/>
            <signals>
              <signal pad="PB11" function="A" group="UOTGID"/>
              <signal pad="PB10" function="A" group="UOTGVBOF"/>
            </signals>
          </instance>
        </module>
        <module name="USART" version="6089ZF">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x40098000"/>
            <signals>
              <signal pad="PB26" function="A" group="CTS" index="0"/>
              <signal pad="PB25" function="A" group="RTS" index="0"/>
              <signal pad="PA10" function="A" group="RXD" index="0"/>
              <signal pad="PA17" function="B" group="SCK" index="0"/>
              <signal pad="PA11" function="A" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x4009C000"/>
            <signals>
              <signal pad="PA15" function="A" group="CTS" index="1"/>
              <signal pad="PA14" function="A" group="RTS" index="1"/>
              <signal pad="PA12" function="A" group="RXD" index="1"/>
              <signal pad="PA16" function="A" group="SCK" index="1"/>
              <signal pad="PA13" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
          <instance name="USART2">
            <register-group address-space="base" name="USART2" name-in-module="USART" offset="0x400A0000"/>
            <signals>
              <signal pad="PB23" function="A" group="CTS" index="2"/>
              <signal pad="PB22" function="A" group="RTS" index="2"/>
              <signal pad="PB21" function="A" group="RXD" index="2"/>
              <signal pad="PB24" function="A" group="SCK" index="2"/>
              <signal pad="PB20" function="A" group="TXD" index="2"/>
            </signals>
          </instance>
          <instance name="USART3">
            <register-group address-space="base" name="USART3" name-in-module="USART" offset="0x400A4000"/>
            <signals>
              <signal pad="PF4" function="A" group="CTS" index="3"/>
              <signal pad="PF5" function="A" group="RTS" index="3"/>
              <signal pad="PD5" function="B" group="RXD" index="3"/>
              <signal pad="PE16" function="B" group="SCK" index="3"/>
              <signal pad="PD4" function="B" group="TXD" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" version="6080F">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1A50"/>
