turbq/atprog/packs/atmel/SAM3X_DFP/1.0.50/atdf/ATSAM3X4E.atdf
      <value-group caption="" name="UOTGHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
